[{
        "riddle": "What question can someone ask all day long, always get totally different answers, and yet all the answers could be correct?",
        "answer": "What time is it?"
    },
    {
        "riddle": "How can you smell if you don’t have a nose?",
        "answer": "Dont take a shower"
    },
    {
        "riddle": "Which tire does not move when a car turns right?",
        "answer": "The spare tire"
    },
    {
        "riddle": "A man is lying shot on the road. The police come to investigate. Right away, they know who shot him. Why?",
        "answer": "He is only shot, not dead"
    },
    {
        "riddle": "What do you give to others but still try and keep?",
        "answer": "A promise"
    },
    {
        "riddle": "A family has five children: January, February, March and April. What is the fifth child’s name.",
        "answer": "What is the name of the child.  This one is tricky, it did not ask a question"
    },
    {
        "riddle": "What has 13 hearts but no organs?",
        "answer": "A deck of cards"
    },
    {
        "riddle": "When does Christmas come before Thanksgiving?",
        "answer": "In a dictionary"
    },
    {
        "riddle": "A guy has 367 apples. You take away 34. How many apples do you have?",
        "answer": "34"
    },
    {
        "riddle": "What has teeth but can’t eat?",
        "answer": "A comb"
    },
    {
        "riddle": "I am first on earth, second on heaven. I appear twice in a week, never in a month, but once in a year. What am I?",
        "answer": "The letter E"
    },
    {
        "riddle": "Three men are on a boat. The boat sinks but only two people get their hair wet. Why?",
        "answer": "The third man was bald"
    },
    {
        "riddle": "Where do locksmiths go on vacation?",
        "answer": "The Florida Keys"
    },
    {
        "riddle": "Jack and Jill were found on the ground dead with with water and shattered glass around them. What happened?",
        "answer": "Jack and Jill were fish, their bowl fell and broke"
    },
    {
        "riddle": "What does everyone need, want, and ask for for but never take?",
        "answer": "Advice"
    },
    {
        "riddle": "Why does Jupiter fart so much?",
        "answer": "Because its a giant gas planet"
    },
    {
        "riddle": "What do you call a group of a dozen atoms?",
        "answer": "Dozen matter"
    },
    {
        "riddle": "I am a ship that can be made to ride the greatest waves. I am not built by tool, but built by hearts and minds. What am I?",
        "answer": "Friendship"
    },
    {
        "riddle": "Why don’t tall mountains ever catch a cold?",
        "answer": "Because they have a snow cap"
    },
    {
        "riddle": "In what month of the year do people eat the least amount of food?",
        "answer": "February"
    },
    {
        "riddle": "Why are there no living cats on Mars?",
        "answer": "Curiosity"
    },
    {
        "riddle": "I get smaller every time I take a bath. What am I?",
        "answer": "Soap"
    },
    {
        "riddle": "They are dark and on the run, without sun there will be none. What are they?",
        "answer": "Shadows"
    },
    {
        "riddle": "What is a rappers favorite candy?",
        "answer": "Eminems"
    },
    {
        "riddle": "What five letter word stays the same when you take away the first, third, and last letter?",
        "answer": "Empty"
    },
    {
        "riddle": "If two is a company and three is a crowd. What is four and five?",
        "answer": "Nine"
    },
    {
        "riddle": "Which of Santa’s reindeer has bad manners?",
        "answer": "Rude-olph"
    },
    {
        "riddle": "What goes through towns and over hills but never moves?",
        "answer": "Roads"
    },
    {
        "riddle": "They come out at night without being called. They are lost in the day without being stolen. What are they?",
        "answer": "Stars"
    },
    {
        "riddle": "What is a snowman’s favorite cereal?",
        "answer": "Frosted Flakes"
    },
    {
        "riddle": "I can be cracked, I can be made. I can be told, I can be played. What am I?",
        "answer": "A joke"
    },
    {
        "riddle": "What has hands but can’t pick up anything?",
        "answer": "A clock"
    },
    {
        "riddle": "I can breathe but never talk, I can run but never walk, I can be picked but never be chosen. What am I?",
        "answer": "A nose"
    },
    {
        "riddle": "Which word contains all 26 letters but only three syllables?",
        "answer": "Alphabet"
    },
    {
        "riddle": "What is the difference between a teacher and a train?",
        "answer": "A teacher says, “spit out your gum” and a train goes, “chew, chew”."
    },
    {
        "riddle": "I can bring a smile to your face, a tear to your eye, or even a thought to your mind. But, I can’t be seen. What am I?",
        "answer": "A memory"
    },
    {
        "riddle": "Everyone has me but nobody can lose me. What am I?",
        "answer": "A shadow"
    },
    {
        "riddle": "What kind of men are always above board?",
        "answer": "Chessmen"
    },
    {
        "riddle": "I start off dry but come out wet. I go in light and come out heavy. What am I?",
        "answer": "A teabag"
    },
    {
        "riddle": "What is it that no one wants yet no one want to lose?",
        "answer": "A lawsuit"
    },
    {
        "riddle": "What has branches and leaves but has no bark?",
        "answer": "A library"
    },
    {
        "riddle": "What do you throw away that keeps on returning?",
        "answer": "Boomerang"
    },
    {
        "riddle": "You use me from your head to your toes, the more I work the thinner I grow. What am I?",
        "answer": "A bar of soap"
    },
    {
        "riddle": "Tear one off and scratch my head; what was once red is black instead. What am I?",
        "answer": "A match"
    },
    {
        "riddle": "What is made of wood but can’t be sawed?",
        "answer": "Sawdust"
    },
    {
        "riddle": "I am always hungry. I must be fed. Whatever I touch will soon turn red. What am I?",
        "answer": "Fire"
    },
    {
        "riddle": "Tear off my skin and I won’t cry but you will. What am I?",
        "answer": "Onion"
    },
    {
        "riddle": "What goes all around a hockey rink but never moves?",
        "answer": "The Boards"
    },
    {
        "riddle": "What type of lion never roars?",
        "answer": "A dandelion"
    },
    {
        "riddle": "I Start with M, end with X and have never ending amount of letters. What am I?",
        "answer": "Mailbox"
    },
    {
        "riddle": "A woman is sitting in her room at night. She has no lights on, no candle, no lamp, no light at all and yet she is reading. How is that possible?",
        "answer": "She is reading braille"
    },
    {
        "riddle": "What do tigers have that no other animal can have?",
        "answer": "Baby tigers"
    },
    {
        "riddle": "Why did the snail paint a big “S” on his car?",
        "answer": "So everyone would say, “look at that escargot”
    },
    {
        "riddle": "I start with S and end with IT, and have you in the middle. What am I?",
        "answer": "Suit"
    },
    {
        "riddle": "What do you call a famous lobster?",
        "answer": "A lobSTAR"
    },
    {
        "riddle": "What is often returned but is never borrowed?",
        "answer": "Thanks"
    },
    {
        "riddle": "I have cities but no houses, moutains but no trees, and water but no fish. What am I?",
        "answer": "A map"
    },
    {
        "riddle": "What has hundreds of ears but can’t hear?",
        "answer": "A corn field (it has ears of corn)"
    },
    {
        "riddle": "What did the boy coffee say to the girl coffee?",
        "answer": "I love you a latte"
    },
    {
        "riddle": "What month do all soldiers hate?",
        "answer": "March"
    },
    {
        "riddle": "Where can you find success before work?",
        "answer": "In the dictionary"
    },
    {
        "riddle": "What do you call a three humped camel?",
        "answer": "Pregnant!"
    },
    {
        "riddle": "Why is an island like the letter “T”?",
        "answer": "Because both are in the middle of the water. (T is the middle word of “water”)"
    },
    {
        "riddle": "What do you call a tick that loves math?",
        "answer": "A arithmetic"
    },
    {
        "riddle": "Why do you never bring a Pokemon in the bathroom, with you?",
        "answer": "They might pickachu"
    },
    {
        "riddle": "I’m often running yet I have no legs. You need me but I don’t need you. What am I?",
        "answer": "Water"
    }
]
